# iMPORT PANDAS BEFORE GETTING STARTED

In [2]:
#Import packages pandas packages
import pandas as pd

# creating dataframe from dictionary sequence

In [3]:
UR_Web_Visit = {
    'Day':[1,2,3,4,5,6],
    'Visitors':[2000,1500,5000,2000,900,750],
    'Bounce Rate':[30,30,28,21,15,38]
}

#convergt dictionary into pandas dataframe and store into df variable
df = pd.DataFrame(UR_Web_Visit)

#print df (df is a dataframe variable)
df

   Day  Visitors  Bounce Rate
0    1      2000           30
1    2      1500           30
2    3      5000           28
3    4      2000           21
4    5       900           15
5    6       750           38

In [4]:
# Reading csv external file using pandas
product_df=pd.read_csv('datasets/product.csv')
#printing product_df data frame
product_df

   Product_ID Product_Name     Category  Price Seller_City
0         101        Watch      Fashion    299       Delhi
1         102          Bag      Fashion   1350      Mumbai
2         103        Shoes      Fashion   2999     Chennai
3         104   Smartphone  Electronics  14999     Klokata
4         105        Books        Study    145       Delhi
5         106          Oil      Grocery    110     Chennai
6         107       Laptop  Electronics  79999   Bengalore

# Slicing first two rows

In [5]:
# To print first-two element we use head function and pass 2 as an argument
#If you want to print more/less rows, you can increase/decrease argument value
# If you dont provide an argument in head() function. It prints first-five rows by default
df.head(2)

   Day  Visitors  Bounce Rate
0    1      2000           30
1    2      1500           30

# Slicing last two rows

In [6]:
# To print first-two element we use tail function and pass 2 as an argument
#If you want to print more/less rows, you can increase/decrease argument value
# If you dont provide an argument in tail() function. It prints last-five rows by default
df.tail(2)

   Day  Visitors  Bounce Rate
4    5       900           15
5    6       750           38

In [7]:
df.sample(3)

   Day  Visitors  Bounce Rate
1    2      1500           30
5    6       750           38
2    3      5000           28

In [8]:
import statistics as sts
usr=df.Visitors
print(usr)
m=sts.median(usr)
print(m)

0    2000
1    1500
2    5000
3    2000
4     900
5     750
Name: Visitors, dtype: int64
1750.0

# merge dataframe

In [9]:
# Reading csv external file using pandas
product_df=pd.read_csv('datasets/product.csv')
#printing product_df data frame
product_df

   Product_ID Product_Name     Category  Price Seller_City
0         101        Watch      Fashion    299       Delhi
1         102          Bag      Fashion   1350      Mumbai
2         103        Shoes      Fashion   2999     Chennai
3         104   Smartphone  Electronics  14999     Klokata
4         105        Books        Study    145       Delhi
5         106          Oil      Grocery    110     Chennai
6         107       Laptop  Electronics  79999   Bengalore

In [10]:
# Reading csv external file using pandas
customer_df=pd.read_csv('datasets/customer.csv')
#printing product_df data frame
customer_df

   ID     Name  Age  Product_ID Purchased_Product       City
0   1   Olivia   20         101             Watch     Mumbai
1   2   Aditya   25           0                Na      Delhi
2   3     Cory   15         106               Oil  Bangalore
3   4  Isabell   10           0               NaN    Chennai
4   5  Dominic   30         103             Shoes    Chennai
5   6    Tyler   65         104        Smartphone      Delhi
6   7   Samuel   35           0               NaN    Kolkata
7   8   Daniel   18           0               NaN      Delhi
8   9   Jeremy   23         107            Laptop     Mumbai

In [11]:
#Inner merge
pd.merge(product_df,customer_df,how='inner', on='Product_ID')

,Product_ID,Product_Name,Category,Price,Seller_City,ID,Name,Age,Purchased_Product,City
0,101,Watch,Fashion,299,Delhi,1,Olivia,20,Watch,Mumbai
1,103,Shoes,Fashion,2999,Chennai,5,Dominic,30,Shoes,Chennai
2,104,Smartphone,Electronics,14999,Klokata,6,Tyler,65,Smartphone,Delhi
3,106,Oil,Grocery,110,Chennai,3,Cory,15,Oil,Bangalore
4,107,Laptop,Electronics,79999,Bengalore,9,Jeremy,23,Laptop,Mumbai

In [12]:
pd.merge(product_df,customer_df,how='inner',left_on='Product_Name',right_on='Purchased_Product')

,Product_ID_x,Product_Name,Category,Price,Seller_City,ID,Name,Age,Product_ID_y,Purchased_Product,City
0,101,Watch,Fashion,299,Delhi,1,Olivia,20,101,Watch,Mumbai
1,103,Shoes,Fashion,2999,Chennai,5,Dominic,30,103,Shoes,Chennai
2,104,Smartphone,Electronics,14999,Klokata,6,Tyler,65,104,Smartphone,Delhi
3,106,Oil,Grocery,110,Chennai,3,Cory,15,106,Oil,Bangalore
4,107,Laptop,Electronics,79999,Bengalore,9,Jeremy,23,107,Laptop,Mumbai

In [13]:
pd.merge(product_df,customer_df,how='inner',
         left_on=['Product_ID','Seller_City'],
         right_on=['Product_ID','City'])

,Product_ID,Product_Name,Category,Price,Seller_City,ID,Name,Age,Purchased_Product,City
0,103,Shoes,Fashion,2999,Chennai,5,Dominic,30,Shoes,Chennai

# Full merge

In [14]:
pd.merge(product_df,customer_df,on='Product_ID',how='outer')

,Product_ID,Product_Name,Category,Price,Seller_City,ID,Name,Age,Purchased_Product,City
0,101,Watch,Fashion,299.0,Delhi,1.0,Olivia,20.0,Watch,Mumbai
1,102,Bag,Fashion,1350.0,Mumbai,NaN,NaN,NaN,NaN,NaN
2,103,Shoes,Fashion,2999.0,Chennai,5.0,Dominic,30.0,Shoes,Chennai
3,104,Smartphone,Electronics,14999.0,Klokata,6.0,Tyler,65.0,Smartphone,Delhi
4,105,Books,Study,145.0,Delhi,NaN,NaN,NaN,NaN,NaN
5,106,Oil,Grocery,110.0,Chennai,3.0,Cory,15.0,Oil,Bangalore
6,107,Laptop,Electronics,79999.0,Bengalore,9.0,Jeremy,23.0,Laptop,Mumbai
7,0,NaN,NaN,NaN,NaN,2.0,Aditya,25.0,Na,Delhi
8,0,NaN,NaN,NaN,NaN,4.0,Isabell,10.0,NaN,Chennai
9,0,NaN,NaN,NaN,NaN,7.0,Samuel,35.0,NaN,Kolkata
10,0,NaN,NaN,NaN,NaN,8.0,Daniel,18.0,NaN,Delhi

In [15]:
pd.merge(product_df,customer_df,on='Product_ID',how='outer',indicator=True)

,Product_ID,Product_Name,Category,Price,Seller_City,ID,Name,Age,Purchased_Product,City,_merge
0,101,Watch,Fashion,299.0,Delhi,1.0,Olivia,20.0,Watch,Mumbai,both
1,102,Bag,Fashion,1350.0,Mumbai,NaN,NaN,NaN,NaN,NaN,left_only
2,103,Shoes,Fashion,2999.0,Chennai,5.0,Dominic,30.0,Shoes,Chennai,both
3,104,Smartphone,Electronics,14999.0,Klokata,6.0,Tyler,65.0,Smartphone,Delhi,both
4,105,Books,Study,145.0,Delhi,NaN,NaN,NaN,NaN,NaN,left_only
5,106,Oil,Grocery,110.0,Chennai,3.0,Cory,15.0,Oil,Bangalore,both
6,107,Laptop,Electronics,79999.0,Bengalore,9.0,Jeremy,23.0,Laptop,Mumbai,both
7,0,NaN,NaN,NaN,NaN,2.0,Aditya,25.0,Na,Delhi,right_only
8,0,NaN,NaN,NaN,NaN,4.0,Isabell,10.0,NaN,Chennai,right_only
9,0,NaN,NaN,NaN,NaN,7.0,Samuel,35.0,NaN,Kolkata,right_only
10,0,NaN,NaN,NaN,NaN,8.0,Daniel,18.0,NaN,Delhi,right_only

# Left Merge

In [16]:
#Left Merge
pd.merge(product_df,customer_df,on='Product_ID',how='left')

,Product_ID,Product_Name,Category,Price,Seller_City,ID,Name,Age,Purchased_Product,City
0,101,Watch,Fashion,299,Delhi,1.0,Olivia,20.0,Watch,Mumbai
1,102,Bag,Fashion,1350,Mumbai,NaN,NaN,NaN,NaN,NaN
2,103,Shoes,Fashion,2999,Chennai,5.0,Dominic,30.0,Shoes,Chennai
3,104,Smartphone,Electronics,14999,Klokata,6.0,Tyler,65.0,Smartphone,Delhi
4,105,Books,Study,145,Delhi,NaN,NaN,NaN,NaN,NaN
5,106,Oil,Grocery,110,Chennai,3.0,Cory,15.0,Oil,Bangalore
6,107,Laptop,Electronics,79999,Bengalore,9.0,Jeremy,23.0,Laptop,Mumbai

# Right Merge

In [17]:
pd.merge(product_df,customer_df,on='Product_ID',how='right',sort=True, indicator=True)

,Product_ID,Product_Name,Category,Price,Seller_City,ID,Name,Age,Purchased_Product,City,_merge
0,0,NaN,NaN,NaN,NaN,2,Aditya,25,Na,Delhi,right_only
1,0,NaN,NaN,NaN,NaN,4,Isabell,10,NaN,Chennai,right_only
2,0,NaN,NaN,NaN,NaN,7,Samuel,35,NaN,Kolkata,right_only
3,0,NaN,NaN,NaN,NaN,8,Daniel,18,NaN,Delhi,right_only
4,101,Watch,Fashion,299.0,Delhi,1,Olivia,20,Watch,Mumbai,both
5,103,Shoes,Fashion,2999.0,Chennai,5,Dominic,30,Shoes,Chennai,both
6,104,Smartphone,Electronics,14999.0,Klokata,6,Tyler,65,Smartphone,Delhi,both
7,106,Oil,Grocery,110.0,Chennai,3,Cory,15,Oil,Bangalore,both
8,107,Laptop,Electronics,79999.0,Bengalore,9,Jeremy,23,Laptop,Mumbai,both

# Handling Redundancy/Duplicates in Merge

In [18]:
"""Reading product_details_with_duplicate_data.csv file 
which is having duplicates data"""

product_duplicate=pd.read_csv('datasets/product_details_with_duplicate_data.csv')
product_duplicate

   Product_ID Product_name     Category    Price Seller_City
0         101        Watch      Fashion    299.0       Delhi
1         102          Bag      Fashion   1350.5      Mumbai
2         103        Shoes      Fashion   2999.0     Chennai
3         104   Smartphone  Electronics  14999.0     Kolkata
4         105        Books        Study    145.0       Delhi
5         106          Oil      Grocery    110.0     Chennai
6         107       Laptop  Electronics  79999.0   Bengalore
7         103        Shoes      Fashion   2999.0     Chennai
8         107       Laptop  Electronics  79999.0   Bengalore

In [19]:
product_duplicate.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8     True
dtype: bool

In [20]:
#drop duplicates in dataset before merge
pd.merge(product_duplicate.drop_duplicates(),customer_df,how='inner',on='Product_ID')

,Product_ID,Product_name,Category,Price,Seller_City,ID,Name,Age,Purchased_Product,City
0,101,Watch,Fashion,299.0,Delhi,1,Olivia,20,Watch,Mumbai
1,103,Shoes,Fashion,2999.0,Chennai,5,Dominic,30,Shoes,Chennai
2,104,Smartphone,Electronics,14999.0,Kolkata,6,Tyler,65,Smartphone,Delhi
3,106,Oil,Grocery,110.0,Chennai,3,Cory,15,Oil,Bangalore
4,107,Laptop,Electronics,79999.0,Bengalore,9,Jeremy,23,Laptop,Mumbai

In [21]:
#use validator in merege
pd.merge(product_duplicate,customer_df,how='inner',on='Product_ID', validate='many_to_many')

,Product_ID,Product_name,Category,Price,Seller_City,ID,Name,Age,Purchased_Product,City
0,101,Watch,Fashion,299.0,Delhi,1,Olivia,20,Watch,Mumbai
1,103,Shoes,Fashion,2999.0,Chennai,5,Dominic,30,Shoes,Chennai
2,103,Shoes,Fashion,2999.0,Chennai,5,Dominic,30,Shoes,Chennai
3,104,Smartphone,Electronics,14999.0,Kolkata,6,Tyler,65,Smartphone,Delhi
4,106,Oil,Grocery,110.0,Chennai,3,Cory,15,Oil,Bangalore
5,107,Laptop,Electronics,79999.0,Bengalore,9,Jeremy,23,Laptop,Mumbai
6,107,Laptop,Electronics,79999.0,Bengalore,9,Jeremy,23,Laptop,Mumbai

# Changing the Index and Column Headers

In [22]:
# Creating df1 to demostarte Indexing and Chnage Column headers
df1 = pd.DataFrame({"Day":[1,2,3,4],"Visitors":[200,100,230,300],"Bounce_Rate":[20,45,60,10]})
df1

   Day  Visitors  Bounce_Rate
0    1       200           20
1    2       100           45
2    3       230           60
3    4       300           10

In [23]:
df1.set_index('Day', inplace=True)

In [25]:
df1.rename(columns={'Day':'Id', 'Visitors':'Visitor'})

     Visitor  Bounce_Rate
Day
1        200           20
2        100           45
3        230           60
4        300           10

# Before Getting Started Create three Data Frames for learning Concatenation

In [26]:
#Creating dataframe df1
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index=[0, 1, 2, 3])
#Dsipalying df1
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [28]:
#creating df2
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index=[4, 5, 6, 7])
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [29]:
# creating df3
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                   index=[8, 9, 10, 11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

# Putting dataframes df1,df2, and df3 into a list

In [30]:
#Putting dataframes df1,df2, and df3 into a list
frames = [df1, df2, df3]

In [31]:
frames

[    A   B   C   D
 0  A0  B0  C0  D0
 1  A1  B1  C1  D1
 2  A2  B2  C2  D2
 3  A3  B3  C3  D3,
     A   B   C   D
 4  A4  B4  C4  D4
 5  A5  B5  C5  D5
 6  A6  B6  C6  D6
 7  A7  B7  C7  D7,
       A    B    C    D
 8    A8   B8   C8   D8
 9    A9   B9   C9   D9
 10  A10  B10  C10  D10
 11  A11  B11  C11  D11]

# Concatenating dataframes df1,df2 and df3 using concat() function

In [32]:
#Concatenating dataframes df1,df2 and df3
result = pd.concat([df1,df2,df3])
#Printing result dataframe after concatenation
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [35]:
"""To associate specific keys with each of the pieces of the chopped up DataFrame. 
We can do this using the keys argument"""
result = pd.concat(frames, keys=['x', 'y', 'z'])
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

# Python Pandas Indexing, Slicing and Subsetting DataFrames<hr>